#include "main.h"

static wear_info wear_data[] = {{"Head", "Голова", "Головной убор"},
{"Neck", "Шея", "Амулет"},
{"Armor", "Броня", "Доспех"},
{"MeleeWeapon", "Оружие ближнего боя", "Оружие ближнего боя"},
{"OffhandWeapon", "Оружие поддержки", "Оружие поддержки"},
{"RangedWeapon", "Дистанционное оружие", "Дистанционное оружие"},
{"GridleWear", "Пояс", "Пояс"},
{"LeftRing", "Кольцо на левом пальце"},
{"RightRing", "Кольцо на пальце", "Кольцо"},
{"Legs", "Ноги", "Обувь"},
{"Backpack", "Рюкзак"},
{"Book", "Книга", "Книга"},
{"Wand", "Волшебное устройство", "Волшебное устройство"},
{"Scroll", "Свиток", "Свиток"},
{"Potion", "Зелье", "Зелье"},
{"Edible", "Еда", "Еда"},
{"Gem", "Драгоценность", "Драгоценность"},
};
assert_enum(wear, LastWear);
getstr_enum(wear);